# St7GetGlobalLogicalValue

Returns a global logical variable, which is internal to the Strand7 application.

long St7GetGlobalLogicalValue(long Index, bool* Value)

Input Parameters

Index

One of the following global integer indexes.

Index

Notes

lvFormulaParseError  An error occurred evaluating an attribute formula.

Output Parameters

Value

Global boolean state variable.